9б ПрограмиранеПрограмиране
Преобразуване на типове и побитови операции - упражнение
Bozhidar Dimitrov
•
15.12.2022 г.
100 точки
Краен срок: 21.12.2022 г., 23:59 ч.
1. Направете файл “quadraticroots.h” в който се декларира структура “QuadraticRootsResult”, която държи резултат от намирането на корените на квадратно уравнение. Структурата трябва да съдържа две член-променливи: x1 и x2 които да държат стойностите на корените на дадено квадратно уравнение. Към структурата трябва да има и флаг “norealroots”, който, ако има стойност “1”, означава, че уравнението няма реални корени. Декларирайте функция “findroots”, която да приема три параметара (a, b, c) и да намира корените на квадратното уравнение (ако има такива) или да обозначава, че уравнението няма реални корени. Функцията трябва да връща като резултат променлива от тип “QuadraticRootsResult”. Целта на задачата е да направите структурата и функцията да работят за всякакви данни, така че трябва да изберете подходящите типове за аргументите и член променливите. Направете файл “quadraticroots.c”, който да дефинира функцията “findroots”. За да намерите квадратния корен на дискриминантата използвайте функцията “sqrtl” декларирана в “math.h”. Не забравяйте да свържете библиотеката “libm” за можете да използвате функцията “sqrtl”.  Направете файл “main.c”, който да демонстрира работата на функцията “findroots” извикана с аргументи от различни типове: един път с int аргументи, един път с float аргументи, един път с double аргументи. Направете Makefile, който да построява програмата.
2. Направете програма, която да управлява осветлението на умна къща, която има осем стаи. Състоянието на стаите трябва да се запазва в 8 битова променлива, където всеки бит индикира състоянието на всяка стая. Например ако бит 0 е вдигнат (тоест има стойност 1), това означава че осветлението е запалено в стая 1. Приложението трябва да предоставя меню с две опции. Първата опция (“Switch lights”) трябва да приема номер на стая от конзолата (число от 1 до 8) и да включва осветлението в дадена стая ако, то е изключено или да го изключи ако е включено. Помислете каква побитова операция трябва да използвата за да осъществите тази функционалност. Втората опция (“Print state”), трябва да принтира, в кои стаи осветлението е включено. Пример за резултат от опция две е “The light is on in rooms: 1 2 7”, което означава че осветлението е запалено в стаи 1, 2 и 7.
Коментари за курса
Вашата работа
Предадени
main.c
Текст
Makefile
Двоичен файл
quadraticroots.c
Текст
quadraticroots.h
Текст
zad_2.c
Текст
Частни коментари
Преобразуване на типове и побитови операции - упражнение

#include <stdio.h>
#include "quadraticroots.h"

int main()
{
    struct QuadraticRootsResult roots;
    double a;
    double b;
    double c;

    printf("Enter a:");
    scanf("%lf", &a);

    printf("Enter b:");
    scanf("%lf", &b);

    printf("Enter c:");
    scanf("%lf", &c);

    roots = findroots(a, b, c);

    if(roots.norealroots == 0)
    {
        printf("%lf", roots.x1);
        printf("\n%lf", roots.x2);
        /*  printf("%d", (int)roots.x1);
            printf("\n%d", (int)roots.x2);
        */
        /*  printf("%f", (float)roots.x1);
            printf("\n%f", (float)roots.x2);
        */
    }
    else if(roots.norealroots == 1)
    {
        printf("No real roots!");
    }

    return 0;
}

main.c
Показва се „main.c“.
